Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/local_authority_and_social_housing/notice_to_quit_and_eviction.html.txt.tmx
Source language: en
Languages: ga

source: The Court may decide to hear some or all of the case in camera
ga: Féadfaidh an Chúirt a chinneadh, ina dhiaidh sin, chun éisteacht le cuid den chás nó an cás go léir mar chruinniú iata

source: The Court can make a possession order if it appears that:
ga: Féadfaidh an Chúirt ordú sealbhaithe a dhéanamh más dealraitheach an méid a leanas:

source: • The local authority has grounds for the recovery of possession
ga: • Tá údar ag an údarás áitiúil chun seilbh a aisghabháil

source: • Repossession is a proportionate response to the occupier’s occupation of the dwelling and
ga: • Is ionann athshealbhú agus freagairt chomhréireach ar áitiú áititheora na háite cónaithe, agus

source: • Making such an order is reasonable in all the circumstances
ga: • Is réasúnta a leithéid d’ordú a dhéanamh faoi na cúinsí uile

source: All decisions in the District Court (such as the granting of a possession order) may be appealed to the Circuit Court and a further appeal on a point of law may be made to the High Court
ga: Féadtar gach cinneadh sa Chúirt Dúiche (ar nós ordú sealbhaithe a dheonú) a achomharc leis an gCúirt Chuarda agus féadtar achomharc breise a dhéanamh ar phointe dlí leis an Ard-Chúirt

source: Housing associations can evict you without any reason as long as they follow the correct procedure
ga: Féadfaidh comhlachais tithíochta thú a dhíshealbhú gan aon chúis a thabhairt duit a fhad agus a leanann siad an nós imeachta ceart

source: This means first issuing a notice to quit and then applying to court for a possession order
ga: Ciallaíonn seo go bhfuil orthu fógra fágála a eisiúint ar dtús agus iarratas a dhéanamh ar an gcúirt ar ordú ina dhiaidh sin

source: However, in practice, housing associations do not evict their tenants without reason and if you pay your rent and comply with other conditions of the tenancy, you will normally be able to stay in your home for as long as you want
ga: I gcleachtas, áfach, ní dhíshealbhaíonn comhlachais tithíochta a dtionóntaí gan chúis agus má íocann tú do chíos agus má chomhlíonann tú coinníollacha eile na tionóntachta, is gnách go mbeidh tú in ann fanacht i do theach chomh fada agus is mian leat

source: If you are in temporary accommodation provided by a housing association, such as a short-term hostel, your position is much weaker and legally the housing association does not even need to issue a notice to quit
ga: Má tá tú i gcóiríocht shealadach a sholáthraíonn comhlachas tithíochta, níl suíomh chomh tréan sin agat agus i dtaobh cúrsaí dlíthiúla de, ní gá don chomhlachas tithíochta fiú fógra fágála a eisiúint

source: Again, however, in practice, housing associations do not evict their tenants without reason
ga: Arís eile, i gcleachtas, áfach, ní dhíshealbhaíonn comhlachais tithíochta a dtionóntaí gan chúis
